[
  {
    "company": "Austin ISD - James Bowie High School",
    "title": "Social Studies Teacher / Coach",
    "dates": "June 2022 - Present",
    "info": "Teacher responsibilities included teaching Academic Government at the senior level and Street Law at the Junior and Senior level, creating curriculum and activities for Street Law, and participating in Student ARD meetings. Coaching responsibilities included coaching running backs and sub-varsity offensive play calling, and assistant track coach specializing in hurdles. Produced weekly self assessment data during the football season and actively participated in all Strength and Conditioning activities across all male sports on campus.",
    "responsibilities": [
      "Managing Team Hudl Profiles",
      "Sub-Varsity offensive coordination",
      "Coordination between teachers & coaches",
      "Designing and implementing SAC programs",
      "Academic planning and coordination in PLCs",
      "Leveraging technology in the Classroom and Coach's Office"
    ]
  },
  {
    "company": "Hays Consolidated ISD - Lehman High School",
    "title": "Social Studies Teacher / Coach",
    "dates": "June 2020 - May 2022",
    "info": "Teacher responsibilities included teaching World Geography in the freshman level, creating and monitoring credit recovery activities, and actively participating in PLC activities. Coaching responsibilities included coaching wide receivers and sub-varsity offensive play calling, assistant powerlifting coach, and assistant track coach specializing in hurdles and high jump. Produced highlights weekly and periodically for athletes and participated in community outreach, actively participating in all Strength and Conditioning activities across all male sports and assisting with laundry duties.",
    "responsibilities": [
      "Sub-Varsity play calling",
      "Managing Team Hudl Profiles",
      "Coordination between teachers & coaches",
      "Designing and implementing SAC programs",
      "Academic planning and coordination in PLCs",
      "Hands on work with freshman students and athletes"
    ]
  }, {
    "company": "University of Mary Hardin Baylor - Strength and Conditioning",
    "title": "Strength and Conditioning Intern",
    "dates": "January 2020 - May 2020",
    "info": "Strength and Conditioning Intern responsible for assisting collegiate athletes with both in-season and off-season workouts, cleaning and maintaining the weight room, setting up equipment for workouts. Worked with athletes in multiple sports with different goals and workout plans. Coordination and communication between the head strength coach and the interns occur within staff meetings and regular one-on-one meetings with members of the program. Internship is to be concluded with a project that includes the creation of a complete and heavily detailed workout plan for a six-week period. Internship expected to be concluded May 2020 with the accumulation of 150 work hours.",
    "responsibilities": [
      "Motivating athletes",
      "Facilities management",
      "Setting up / tearing down facilities",
      "Distinguishing needs of various athletes",
      "Implementing protocol for treating injured athletes",
      "Ensuring athletes execute assigned lifts / workouts safely"
    ]
  }
]